# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другую.

str1 = input("Введите первую строку: ")
str2 = input("Введите вторую строку: ")
print("Количество совпадений второй строки с первой:", str1.count(str2))
